Repository: scalacenter/scastie
Catalog: client/src/main/resources/locales/*.po
Languages: ja, pl

# topbar.feedback
source: Feedback
ja: フィードバック
pl: Zgłoś uwagę

# topbar.gitter
source: Scastie's gitter
ja: Scastie gitter
pl: Gitter Scastie

# topbar.language_label
source: Language:
ja: 言語:
pl: Język:

# topbar.login
source: Login
ja: ログイン
pl: Zaloguj się

# topbar.feedback_tooltip
source: Open Gitter.im Chat to give us feedback
ja: Gitter.im チャットを開いてフィードバックする
pl: Otwórz czat Gitter.im, aby przekazać nam swoje uwagi.

# topbar.github_tooltip
source: Create new issue on GitHub
ja: GitHub で issue を新規作成する
pl: Stwórz nowe zgłoszenie na Githubie

# topbar.snippets
source: Snippets
ja: スニペット
pl: Fragmenty kodu

# topbar.snippets_tooltip
source: Go to your code snippets
ja: 自分のコードスニペットを見る
pl: Przejdź do Twoich fragmentów kodu

# topbar.logout
source: Logout
ja: ログアウト
pl: Wyloguj się

# snippets.delete
source: Delete
ja: 削除
pl: Usuń

# snippets.share
source: Share
ja: 共有
pl: Udostępnij

# snippets.empty
source: No saved snippets, yet!
ja: スニペットはまだ何も保存されていません!
pl: Brak zapisanych fragmentów kodu!

# snippets.saved
source: Saved Code Snippets
ja: 保存したコードスニペット
pl: Zapisane fragmenty kodu

# snippets.update
source: Update:
ja: 更新:
pl: Aktualizacja:

# sidebar.theme_light
source: Light
ja: ライト
pl: Jasny

# sidebar.theme_dark
source: Dark
ja: ダーク
pl: Ciemny

# sidebar.theme_dark_tooltip
source: Select Dark Theme (F2)
ja: 暗いテーマにする (F2)
pl: Wybierz ciemny motyw (F2)

# sidebar.theme_light_tooltip
source: Select Light Theme (F2)
ja: 明るいテーマにする (F2)
pl: Wybierz jasny motyw (F2)

# sidebar.privacy_policy
source: Privacy Policy
ja: プライバシーポリシー
pl: Polityka prywatności

# sidebar.privacy_policy_tooltip
source: Show privacy policy
ja: プライバシーポリシーを表示する
pl: Pokaż politykę prywatności

# sidebar.help
source: Help
ja: ヘルプ
pl: Pomoc

# sidebar.help_tooltip
source: Show help Menu
ja: ヘルプメニューを表示する
pl: Pokaż menu pomocy

# sidebar.status_unknown
source: Unknown
ja: 不明
pl: Stan nieznany

# sidebar.status_up
source: Up
ja: 動作中
pl: Działa

# sidebar.status_down
source: Down
ja: 動作停止
pl: Nie działa

# sidebar.status_tooltip
source: Show runners status
ja: ランナーの状態を表示する
pl: Pokaż status procesów

# sidebar.editor
source: Editor
ja: エディタ
pl: Edytor

# sidebar.build_settings
source: Build Settings
ja: ビルド設定
pl: Ustawienia kompilacji

# sidebar.login_title
source: Login to Scastie
ja: Scastie にログイン
pl: Zaloguj się do Scastiego

# sidebar.login_github
source: Continue with GitHub
ja: GitHub でログインする
pl: Zaloguj się przez Github

# sidebar.login_agreement
source: By signing in, you agree to our {privacy policy}.
ja: サインインすることで、{プライバシーポリシー}に同意したものとします。
pl: Logując się, akceptujesz naszą {politykę prywatności}.

# editor.run
source: Run
ja: 実行
pl: Uruchom

# editor.status_unknown_warning
source: warning: unknown status
ja: 警告: 不明な状態
pl: ostrzeżenie: nieznany status

# editor.running
source: Running
ja: 実行中
pl: Uruchamianie

# editor.running_tooltip
source: Running your Code...
ja: あなたのコードを実行しています...
pl: Uruchamianie Twojego kodu…

# editor.new_snippet_title
source: New code snippet
ja: 新しいコードスニペット
pl: Nowy fragment kodu

# editor.new
source: New
ja: 新規作成
pl: Nowy

# editor.new_tooltip
source: New Snippet
ja: 新しいスニペット
pl: Nowy fragment kodu

# editor.new_confirmation
source: Are you sure you want to create a new snippet?
ja: スニペットを新規に作成しますか？
pl: Czy na pewno chcesz utworzyć nowy fragment kodu?

# editor.format_tooltip
source: Format Code
ja: コードを整形する
pl: Formatuj kod

# editor.format
source: Format
ja: 整形
pl: Formatuj

# editor.clear_messages
source: Clear Messages
ja: メッセージを消去する
pl: Wyczyść wiadomości

# editor.worksheet_on_tooltip
source: Turn Worksheet mode ON (evaluate and print each top level expression)
ja: ワークシートモード (トップレベルの式をそれぞれ評価して表示) を有効化する
pl: Włącz tryb Worksheet (wykonuj i pokazuj każdą instrukcję najwyższego poziomu)

# editor.worksheet_off_tooltip
source: Turn Worksheet mode OFF (evaluate and print each top level expression)
ja: ワークシートモード (トップレベルの式をそれぞれ評価して表示) を無効化する
pl: Wyłącz tryb Worksheet (wykonuj i pokazuj każdą instrukcję najwyższego poziomu)

# editor.worksheet_unsupported
source: This configuration does not support Worksheet mode
ja: この設定はワークシートモードをサポートしていません
pl: Ta konfiguracja nie obsługuje trybu Worksheet

# editor.worksheet
source: Worksheet
ja: ワークシート

# editor.download
source: Download
ja: ダウンロード
pl: Pobierz

# editor.embed
source: Embed
ja: 埋め込む
pl: Osadź

# editor.embed_title
source: Share your Code Snippet
ja: コードスニペットを共有する
pl: Udostępnij swój fragment kodu

# editor.embed_subtitle
source: Copy and embed your code snippet
ja: 自分のコードスニペットをコピーして共有する
pl: Skopiuj i osadź swój fragment kodu

# editor.share_snippet
source: Copy and share your code snippet's URL:
ja: 自分のコードスニペットの URL をコピーして共有する:
pl: Skopiuj i udostępnij adres URL swojego fragmentu kodu:

# editor.metals_status
source: Metals Status
ja: Metals 状態
pl: Status Metalsów

# editor.metals_loading
source: Compiler is loading
ja: コンパイラを読み込み中
pl: Trwa ładowanie kompilatora

# editor.metals_ready
source: Metals is ready
ja: Metals 準備完了
pl: Metalsy są gotowe

# editor.metals_disabled
source: Metals Disabled
ja: Metals は無効です
pl: Metalsy są wyłączone

# editor.metals_unsupported
source: Unsupported Configuration
ja: サポートされない設定です
pl: Niewspierana konfiguracja

# editor.metals_network_error
source: Network Error
ja: ネットワークエラー
pl: Błąd sieci

# build.reset_title
source: Reset Build
ja: ビルド設定をリセット
pl: Resetuj konfigurację

# build.reset_confirmation
source: Are you sure you want to reset the build?
ja: ビルド設定をリセットしますか？
pl: Czy na pewno chcesz zresetować konfigurację?

# build.reset
source: Reset
ja: リセット
pl: Resetuj

# build.reset_tooltip
source: Reset your configuration
ja: 自分の設定をリセットする
pl: Resetuj Twoją konfigurację

# build.target
source: Target
ja: ターゲット
pl: Środowisko docelowe

# build.scala_version
source: Scala Version
ja: Scala バージョン
pl: Wersja Scali

# build.libraries
source: Libraries
ja: ライブラリ
pl: Biblioteki

# build.sbt_config
source: Extra Sbt Configuration
ja: 追加の Sbt 設定
pl: Dodatkowa konfiguracja SBT

# build.sbt_base_config
source: Base Sbt Configuration (readonly)
ja: Sbt ベース設定 (読み取り専用)
pl: Podstawowa konfiguracja SBT (tylko do odczytu)

# build.sbt_plugins_config
source: Base Sbt Plugins Configuration (readonly)
ja: Sbt ベースプラグイン設定 (読み取り専用)
pl: Podstawowa konfiguracja pluginów SBT (tylko do odczytu)

# build.enable_toolkit
source: Enable Toolkit
ja: Toolkit を有効にする
pl: Włącz Toolkit

# build.search_placeholder
source: Search for 'cats'
ja: 'cats' で検索
pl: Szukaj np. 'cats'

# build.other
source: Other
ja: その他
pl: Inna

# console.title
source: Console
ja: 端末
pl: Konsola

# help.title
source: Help about Scastie
ja: Scastie について
pl: Pomoc

# help.description
source: Scastie is an interactive playground for Scala with support for sbt configuration.
ja: Scastie は sbt 設定に対応した、Scala 向けの対話的なプレイグラウンドです。
pl: Scastie to interaktywny edytor online dla Scali z obsługą konfiguracji sbt.

# help.sublime_support
source: Scastie editor supports Sublime Text {keyboard shortcuts}.
ja: Scastie エディタは Sublime Text の {キーボードショートカット} をサポートしています。
pl: Edytor Scastie obsługuje {skróty klawiszowe} Sublime Text.

# help.save
source: Save
ja: 保存
pl: Zapisz

# help.save_description
source: Run and save your code.
ja: 自分のコードを実行・保存します。
pl: Uruchamia i zapisuje Twój kod.

# help.new_description
source: Removes all your code lines from the current editor instance and resets sbt configuration.
ja: 現在のエディタインスタンスのコード行を全て消去し、sbt 設定をリセットします。
pl: Usuwa wszystkie linie kodu z bieżącej instancji edytora i resetuje konfigurację sbt.

# help.clear_messages_description
source: Removes all messages from the current editor instance.
ja: 現在のエディタインスタンスが表示した全てのメッセージを消去します。
pl: Usuwa wszystkie wiadomości z bieżącej instancji edytora.

# help.format_description
source: The code formatting is done by scalafmt. You can configure the formatting with comments in your code. Read the {configuration section}.
ja: コード整形は scalafmt が行います。コメントで整形の設定が可能です。{設定セクション}を参照してください。
pl: Formatowanie kodu jest wykonywane przez scalafmt. Możesz konfigurować formatowanie za pomocą komentarzy w swoim kodzie. Przeczytaj {sekcję dotyczącą konfiguracji}.

# help.worksheet_description
source: Enabled by default, the Worksheet Mode gives the value and the type of each line of your program. You can also add HTML blocks such as: {html"<h1>Hello</h1>"} to render it next to the declaration.
ja: デフォルトで有効です。ワークシートモードはプログラムのそれぞれの行の値と型を表示します。{html"<h1>Hello</h1>"}のようなHTMLブロックを追加し、宣言のそばに出力することもできます
pl: Domyślnie włączony tryb Worksheet pokazuje wartość i typ każdej linii Twojego programu. Możesz także dodać bloki HTML, takie jak: {html"<h1>Hello</h1>"}, aby wyświetlić je obok deklaracji.

# help.worksheet_packages_warning
source: In Worksheet Mode you cannot use packages. If you want to use it, turn off the Mode and add a main method and println statements.
ja: ワークシートモードではパッケージを使えません。パッケージを使いたい場合は、モードをオフにして main メソッドと println ステートメントを追加してください。
pl: W trybie Worksheet nie możesz używać pakietów/paczek. Jeśli chcesz ich użyć, wyłącz ten tryb i dodaj metodę main oraz instrukcje println.

# help.download_description
source: Create a zip package with sbt configuration for current snippet.
ja: 現在のスニペットを sbt 設定とともに zip パッケージにします。
pl: Utwórz paczkę zip z konfiguracją sbt dla bieżącego fragmentu kodu.

# help.embed_description
source: Create an url embeddable in external web pages.
ja: 外部の web ページに埋め込むことができる URL を作成します。
pl: Utwórz adres URL możliwy do osadzenia na zewnętrznych stronach internetowych.

# help.console_description
source: You can see your code's output in the Scastie's console.
ja: Scastie の端末を使って、自分のコードの出力を確認できます。
pl: Możesz zobaczyć wynik działania swojego kodu w konsoli Scastie.

# help.build_settings_description
source: In Build Settings you can change the Scala version and add libraries, choose your desired target and even add your own custom sbt configuration.
ja: ビルド設定では Scala のバージョンを変更したり、ライブラリを追加したり、ターゲットを選択したり、カスタムの sbt 設定を追加することもできます。
pl: W ustawieniach kompilacji możesz zmienić wersję Scali i dodać biblioteki, wybrać docelowe środowisko oraz dodać własną konfigurację sbt.

# help.snippets_title
source: User's Code Snippets
ja: ユーザのコードスニペット
pl: Fragmenty kodu użytkownika

# help.snippets_description
source: Your saved code fragments will appear here and you'll be able to delete or share them.
ja: 保存した自分のコード片がここに表示されます。削除したり共有することもできます。
pl: Twoje zapisane fragmenty kodu pojawią się tutaj i będziesz mógł je usuwać lub udostępniać.

# help.feedback_description
source: You can join our {Gitter} channel and send issues.
ja: 私たちの {Gitter} チャンネルに参加して問題点をお知らせ下さい。
pl: Możesz dołączyć do naszego kanału {Gitter} i zgłaszać problemy.

# help.buildinfo
source: BuildInfo
ja: ビルド情報
pl: Informacje o buildzie

# help.github_info
source: It's available on Github at {scalacenter/scastie}.
ja: Github の {scalacenter/scastie} で提供されます
pl: Można je znaleźć na Githubie - {scalacenter/scastie}.

# help.license
source: License
ja: ライセンス
pl: Licencja

# help.original_idea
source: Scastie is an original idea from Aleh Aleshka (OlegYch)
ja: Scastie はAleh Aleshka (OlegYch) によるオリジナルアイデアです
pl: Scastie to oryginalny pomysł, którego autorem jest Aleh Aleshka (OlegYch).

# status.no_task
source: No Task Running
ja: 実行中のタスクはありません
pl: Brak uruchomionych zadań

# status.task
source: Task
ja: タスク
pl: Zadania

# status.different_config
source: Different Configuration
ja: 異なる設定
pl: Inna konfiguracja

# status.same_config
source: Same Configuration
ja: 同一の設定
pl: Ta sama konfiguracja

# status.sbt_runners
source: Sbt Runners
ja: Sbt ランナー
pl: Procesy Sbt

# topbar.github_issues
source: Github issues
pl: Zgłoszenia na Githubie
